demo-output/website/campaign/F3_runs/diamond/M2.5_eps5/medium/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       15760;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       15800;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          80;
        startFace       15840;
    }
    top
    {
        type            patch;
        nFaces          200;
        startFace       15920;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       16120;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16000;
        startFace       16240;
    }
)

// ************************************************************************* //
